{
    "title": "Abitur 2024: Graduating with great Success",
    "slug": "abitur",
    "title_de": "Abitur 2024: Ein großer Erfolg",
    "image": "/cv/abitur.webp",
    "content": [
        {
            "type": "headline",
            "text": "Receiving the MINT-EC Certificate",
            "text_de": "Auszeichnung mit dem MINT-EC Zertifikat"
        },
        {
            "type": "text",
            "text": "Alongside my Abitur in 2024 at the Hanns-Seidel-Gymnasium I received the prestigious MINT-EC certificate for excellence in STEM subjects with honoration. This certification is awarded to students who have demonstrated exceptional performance in mathematics, computer science, natural sciences, and technology. The MINT-EC network connects schools, universities, and research institutions to promote STEM education and foster collaboration among students and educators.",
            "text_de": "Zusätzlich zu meinem Abitur 2024 am Hanns-Seidel-Gymnasium erhielt ich das renommierte MINT-EC-Zertifikat für hervorragende Leistungen in den MINT-Fächern mit Auszeichnung. Diese Zertifizierung wird an Schüler verliehen, die außergewöhnliche Leistungen in Mathematik, Informatik, Naturwissenschaften und Technik gezeigt haben. Das MINT-EC-Netzwerk verbindet Schulen, Universitäten und Forschungseinrichtungen, um die MINT-Bildung und die Zusammenarbeit zwischen Schülern und Lehrern zu fördern."
        },
        {
            "type": "image",
            "src": "/content/abitur-mintec-cluster.webp",
            "text": "Group photo of the MINT-EC AI cluster",
            "text_de": "Gruppenfoto des MINT-EC KI-Clusters"
        },
        {
            "type": "text",
            "text": "Also I'm part of the ongoing MINT-EC AI cluster, working on the vision of bringing AI education into classrooms. As this cluster is in deep collaboration with important German companies like SAP or Airbus, I'm excited to be part of this project. My work group is in active development of collecting AI resources to create a project kit for students to start their own AI projects.",
            "text_de": "Außerdem bin ich Teil des laufenden MINT-EC KI-Clusters, der daran arbeitet, KI-Bildung in die Klassenzimmer zu bringen. Besonders weil dieser Cluster in enger Zusammenarbeit mit wichtigen deutschen Unternehmen wie SAP oder Airbus steht, freue ich mich sehr, Teil dieses Projekts zu sein. Aktuell entwickelt meine Arbeitsgruppe aktiv an KI-Ressourcen, um ein Projekt-Kit für Schüler zu erstellen, mit dem sie ihre eigenen KI-Projekte starten können."
        },
        {
            "type": "link",
            "text": "Learn more about MINT-EC",
            "text_de": "Erfahre mehr über MINT-EC",
            "href": "https://mint-ec.de"
        },

        {
            "type": "headline",
            "text": "The Best in Physics: Recognition by the DPG",
            "text_de": "Der Beste in Physik: Anerkennung durch die DPG"
        },
        {
            "type": "text",
            "text": "In addition to the MINT-EC certificate, I was honored with the Physics Award by the German Physical Society (DPG) for my achievements in the field of physics. The DPG is one of the largest physics societies in the world, and receiving this award in combination with a book prize was a great honor. I'm trilled to be part of this community and to get in contact with cutting-edge research.",
            "text_de": "Zusätzlich zum MINT-EC-Zertifikat wurde ich für meine Leistungen im Bereich der Physik mit dem Preis der Deutschen Physikalischen Gesellschaft (DPG) ausgezeichnet. Die DPG ist eine der größten physikalischen Gesellschaften der Welt, und die Auszeichnung in Kombination mit einem Buchpreis war für mich eine sehr große Ehre. Daher freue ich mich sehr, Teil dieser Gemeinschaft zu sein und mit Spitzenforschung in Kontakt zu treten."
        },
        {
            "type": "link",
            "text": "Learn more about the DPG",
            "text_de": "Erfahre mehr über die DPG",
            "href": "https://dpg-physik.de"
        },

        {
            "type":"headline",
            "text": "Invitation to the DMV",
            "text_de": "Einladung in die DMV"
        },
        {
            "type": "text",
            "text": "As a result of my success in mathematics, I was invited to a membership in the German Mathematical Society (DMV). The DMV is one of the oldest and most renowned mathematical societies in the world, and I am honored to be part of this community. Allowing me to connect with leading mathematicians and researchers.",
            "text_de": "Aufgrund meines Erfolgs in der Mathematik Abiturprüfung wurde ich zur Mitgliedschaft in der Deutschen Mathematiker-Vereinigung (DMV) eingeladen. Die DMV ist eine der ältesten und renommiertesten mathematischen Gesellschaften überhaupt, und ich fühle mich geehrt, Teil dieser Gemeinschaft zu sein. Dies ermöglicht es mir, mich mit führenden Mathematikern und Forschern zu vernetzen."
        },
        {
            "type": "link",
            "text": "Learn more about the DMV",
            "text_de": "Erfahre mehr über die DMV",
            "href": "https://www.mathematik.de/"
        }


       
    ]
}