{
  "title": "Empowering Young Minds: My Gap Year as a STEM Tutor",
  "slug": "bufdi",
  "title_de": "Begeisterung wecken: Mein Bundesfreiwilligendienst als MINT-Tutor",
  "image": "/cv/bufdi.webp",
  "content": [
    {
      "type": "text",
      "text": "Taking a gap year is often seen as a time for exploration, learning, and growth. For me, this year has been an incredible opportunity to contribute to STEM education while gaining invaluable experience through my role as a voluntary STEM tutor at the Walter-Reis-Institut (WRI). Through hands-on workshops and mentorship, I have had the privilege of inspiring young minds and fostering a passion for science and technology.",
      "text_de": "Ein Gap Year wird oft als eine Zeit der Erkundung, des Lernens und des persönlichen Wachstums betrachtet. Für mich war dieses Jahr eine unglaubliche Chance, die MINT-Bildung zu verstehen, mitzugestalten und gleichzeitig wertvolle Erfahrungen als MINT-Tutor am Walter-Reis-Institut (WRI) zu sammeln. Durch praxisnahe Workshops hatte ich die Möglichkeit, Technikinteressierte zu inspirieren und ihre Begeisterung für Wissenschaft und Technik zu wecken."
    },
    {
      "type": "headline",
      "text_de": "Auszeichnung als nationaler MINT-Botschafter",
      "text": "Awarded as a National STEM Ambassador"
    },
    {
      "type": "text",
      "text_de": "Im Rahmen meiner Tätigkeit am WRI wurde ich als nationaler MINT-Botschafter ausgezeichnet. Diese Auszeichnung wird an Personen verliehen, die sich besonders für die Förderung von MINT-Themen einsetzen. Ich bin stolz darauf, Teil der Initiative MINT Zukunft schaffen zu sein und dazu beizutragen, das Interesse an MINT-Fächern zu fördern. Getragen wird die Initiative unter der Schirmherrschaft des deutschen Bundeskanzlers.",
      "text": "As part of my role at WRI, I was awarded as a national STEM ambassador. This recognition is given to individuals who are particularly committed to promoting STEM topics. I am proud to be part of the MINT Zukunft schaffen initiative and contribute to fostering interest in STEM subjects. The initiative is supported by the German Chancellor."
    },
    {
      "type": "image",
      "src": "/content/bufdi-mintbotschafter.webp",
      "text_de": "Auszeichnung als nationaler MINT-Botschafter",
      "text": "Awarded as a National STEM Ambassador"
    },
    {
      "type": "link",
      "text_de": "MINT-Botschafter Tim Arnold im Interview",
      "text": "STEM Ambassador Tim Arnold in Interview",
      "href": "https://mintzukunftschaffen.de/2025/05/15/mint-botschafter-tim-arnold-im-interview/"
    },
    {
      "type": "headline",
      "text": "Bringing STEM to Life: Workshops and Hands-on Learning",
      "text_de": "MINT erlebbar machen: Workshops und praktisches Lernen"
    },
    {
      "type": "text",
      "text": "One of the core aspects of my role has been organizing and conducting STEM workshops as part of the MINTbayU initiative. This program, initiated by the TH Aschaffenburg University of Applied Sciences, the Regionalmanagement-Initiative Bayerischer Untermain and the Walter Reis Institut, is funded by the Federal Ministry of Education and Research. It offers free extracurricular activities in mathematics, computer science, natural sciences, and engineering. By making STEM accessible to children and teenagers, the initiative aims to equip them with essential skills for the future.",
      "text_de": "Ein zentraler Bestandteil meiner Tätigkeit war die Organisation und Durchführung von MINT-Workshops im Rahmen der MINTbayU-Initiative. Dieses Programm, das von der Technischen Hochschule Aschaffenburg, der Regionalmanagement-Initiative Bayerischer Untermain und dem Walter-Reis-Institut ins Leben gerufen wurde, wird vom Bundesministerium für Bildung und Forschung gefördert. Es bietet kostenlose außerschulische Aktivitäten in Mathematik, Informatik, Naturwissenschaften und Technik. Indem MINT-Themen für Kinder und Jugendliche zugänglich gemacht wird, will die Initiative ihnen wichtige Zukunftskompetenzen vermitteln."
    },
    {
      "type": "image",
      "src": "/content/stem-handson.webp",
      "text": "Students participating in a hands-on STEM workshop",
      "text_de": "Schülerinnen und Schüler nehmen an einem praxisnahen MINT-Workshop teil"
    },
    {
      "type": "text",
      "text": "A highlight of my experience has been teaching courses on electrical engineering and programming. In one such workshop, participants built a Wi-Fi-enabled LED matrix and programmed their own animations and games. Seeing the enthusiasm of students as they transformed theoretical concepts into functional projects has been deeply rewarding. The preparation for these courses was intensive, but witnessing the positive impact on students made every effort worthwhile.",
      "text_de": "Ein besonderes Highlight war das Unterrichten von Kursen zu Elektrotechnik und Programmierung. In einem Workshop bauten die Teilnehmer eine WLAN-fähige LED-Matrix und programmierten eigene Animationen und Spiele. Besonders toll war für mich die Begeisterung der Schülerinnen und Schüler zu sehen, wenn sie theoretische Konzepte in funktionierende Projekte umsetzen. Die Vorbereitung dieser Kurse war stellenweise sehr aufwendig, aber die positiven Rückmeldungen der Teilnehmer machte es den Aufwand wert."
    },
    {
      "type": "headline",
      "text": "A Community of Innovators",
      "text_de": "Eine Gemeinschaft von Innovatoren"
    },
    {
      "type": "text",
      "text": "Beyond teaching, my involvement at WRI has allowed me to engage with experts and industry leaders. I have had the chance to interact with professionals from diverse fields, including members of the Walter and Gabriele Reis Foundation's board. These conversations have provided me with insights into technological advancements, entrepreneurship, and the broader impact of STEM education.",
      "text_de": "Über das Unterrichten hinaus ermöglichte mir meine Tätigkeit am WRI den Austausch mit Experten und führenden Persönlichkeiten aus der Industrie. Ich hatte die Gelegenheit, mit Fachleuten aus verschiedenen Bereichen, darunter Mitglieder des Stiftungsrat der Walter und Gabriele Reis Stiftung, ins Gespräch zu kommen. Diese Gespräche gaben mir wertvolle Einblicke in technologische Entwicklungen, Unternehmertum und die weitreichenden Auswirkungen der MINT-Bildung."
    },

    {
      "type": "headline",
      "text_de": "Wissen für Alle: 10-Jahre Stiftungsjubiläum"
    },
    {
      "type": "text",
      "text_de": "Mit dem 10-jährigen Stiftungsjubiläum feierte die Walter und Gabriele Reis Stiftung auch eine besondere Ausgabe der Vortragsreihe \"Wissen für Alle\". Diese Vortragsreihe ist ein wichtiger Bestandteil der Stiftung und bietet eine Plattform für Experten, um ihr Wissen und ihre Erfahrungen zu teilen. Das Besondere: Im Anschluss an die Vorträge haben die Teilnehmer die Möglichkeit, ihre Fragen zu stellen und mit den Referenten zu diskutieren. Zum Jubiläum hielt die Börsenexpertin Anja Kohl einen spannenden Vortrag über die aktuelle politische und wirtschaftliche Lage. Als Teil der Stiftung fand ich es besonders spannend, nach den Vorträgen die Referenten persönlich kennenzulernen und mit ihnen ins Gespräch zu kommen.",
      "text": "With the 10th anniversary of the foundation, the Walter and Gabriele Reis Foundation also celebrated a special edition of the lecture series \"Knowledge for All\". This lecture series is an important part of the foundation and provides a platform for experts to share their knowledge and experiences. The special feature: After the lectures, participants have the opportunity to ask questions and discuss with the speakers. For the anniversary, stock market expert Anja Kohl gave an exciting lecture on the current political and economic situation. As part of the foundation, I found it particularly exciting to meet the speakers personally after the lectures and engage in discussions with them."
    },
    {
      "type": "image",
      "src": "/content/bufdi-wissen-fuer-alle.webp",
      "text": "Anja Kohl at the 10th anniversary of the Walter and Gabriele Reis Foundation",
      "text_de": "Anja Kohl bei der 10-jähriges Stiftungsjubiläum der Walter und Gabriele Reis Stiftung"
    },

  
    {
      "type": "headline",
      "text": "Inspiring the Next Generation of Innovators",
      "text_de": "Die nächste Generation von MINT-begeisterten inspirieren"
    },
    {
      "type": "text",
      "text": "Through my work, I have seen firsthand how early exposure to STEM can spark curiosity and confidence in young learners. The workshops at MINTbayU cater to students from different educational backgrounds, ensuring that anyone with an interest in science and technology can participate without prior knowledge. By creating an inclusive and supportive learning environment, we are helping to shape the next generation of problem-solvers and innovators.",
      "text_de": "Durch meine Arbeit habe ich hautnah erlebt, wie frühe Berührungspunkte mit MINT-Themen Neugier und Selbstvertrauen bei jungen Lernenden wecken können. Die Workshops von MINTbayU richten sich an Schülerinnen und Schüler mit unterschiedlichen Bildungshintergründen und ermöglichen eine Teilnahme ohne Vorkenntnisse. Durch ein inklusives und unterstützendes Lernumfeld trägt die Initiative dazu bei, die nächste Generation von Problemlösern und Innovatoren zu fördern."
    },
    {
      "type": "text",
      "text": "In the coming months of my gap year, I am looking forward to developing new workshops and gaining exciting experiences. The impressions I have gained so far have definitely strengthened my decision to continue engaging with STEM topics in the future.",
      "text_de": "In den nächsten Monaten meines Bundesfreiwilligendiensts freue ich mich darauf, neue Workshops zu entwickeln und spannende Erfahrungen zu sammeln. Die bisherigen Eindrücke haben mich auf jeden Fall in meiner Entscheidung gestärkt, mich auch in Zukunft mit Themen aus dem MINT-Bereich zu beschäftigen."
    },
    {
      "type": "text",
      "text": "Learn more about the MINTbayU initiative",
      "text_de": "Erfahre mehr über die MINTbayU-Initiative"
    },
    {
      "type": "link",
      "text": "MINTbayU",
      "href": "https://mintbayu.de"
    }
  ]
}
