{
    "lang": "de",
    "cvHighlights": "Highlights aus meinem Lebenslauf",
    "cvOnLinkedin": "Vollständigen Lebenslauf auf LinkedIn ansehen",
    "cvJufoHeadline": "Jugend forscht Bundessieger",
    "cvJufoText": "Beim renommierten Wettbewerb „Jugend forscht“ konnte ich mit meinem Projekt Rekari den Bundesieg in der Kategorie gewinnen. Rekari vereinfacht dabei Drohneneinsätze mit intuitiver Planung und Echtzeit-Zusammenarbeit und ist damit für Profis und Freiwilligenteams gleichermaßen zugänglich.",
    "moreInformation": "Weitere Informationen",
    "cvISEFHeadline": "ISEF Finalist",
    "cvISEFText": "Im Jahr 2024 nahm ich an der Regeneron International Science and Engineering Fair (ISEF) teil, dem weltweit größten voruniversitären Wissenschaftswettbewerb in Los Angeles. Im Wettbewerb mit jungen Spitzenforschern aus aller Welt hatte ich die Gelegenheit, mein Projekt auf einer internationalen Bühne zu präsentieren und Ideen mit führenden Wissenschaftlern auszutauschen.",
    "cvBufdiHeadline": "MINT-Tutor am Institut für Technologie",
    "cvBufdiText": "Als Tutor bei der Walter-Reis-Stiftung konzipiere ich Kurse und Workshops, um Schülern technische Konzepte zu vermitteln. Der Schwerpunkt liegt dabei auf praktischen Fertigkeiten wie Entwerfen, Löten und Programmieren, aber auch auf KI-Anwendungen, um den Teilnehmern ein breiteres Verständnis für moderne Technologien zu vermitteln.",
    "cvAbiturHeadline": "Abiturpreisträger",
    "cvAbiturText": "Mit meinem Abitur wurde ich von der Deutschen Mathematiker-Vereinigung mit dem Preis für das beste Mathe-Abitur und von der Deutschen Physikalischen Gesellschaft mit dem Preis für das beste Physik-Abitur ausgezeichnet. Außerdem erhielt ich das MINT-Exzellenz-Zertifikat von MINT-EC, der nationalen Exzellenzinitiative für MINT-Bildung in Deutschland.",

    "niceToMeetYou": "Schön, dich kennenzulernen!",
    "iamtim": "Hallo, ich bin Tim Arnold",

    "recentProjects": "Aktuelle Projekte",
    "rekari": "Rekari",
    "rekariDesc": "Empower the team",
    "foosball": "KI Tischfußball",
    "foosballDesc": "Mensch gegen Maschine",
    "ekes": "Evolutions Simulation",
    "ekesDesc": "KI zum Anfassen",

    "collaborationSection": "Kollaborationen & Erfahrungen mit",

    "letstalk": "Lass uns austauschen",
    "connectOnLinkedin": "Connect on LinkedIn",
    "contactme": "Kontakt",
    "getintouchwithme": "Lass uns kennenlernen",

    "exchangeIdeas": "Neue Ideen finden!",
    "footerText": "Ich bin immer neugierig auf neue Perspektiven und den Austausch von Ideen. Egal, ob es sich um ein kreatives Projekt oder eine neue Herausforderung handelt, ich bin immer für ein Gespräch bereit. Lass uns miteinander reden und sehen, was wir gemeinsam schaffen können.",

    "technicalDetails": "Technische Details",
    "articles": "Artikel",
    "imprint": "Impressum",

    "experienceandsuccess": "Erfahrungen und Erfolge",
    "other": "Sonstiges",
    "back": "Zurück",
    "learnmore": "Mehr erfahren",

    "awardsHGSHeadline": "Hermann-Gutmann-Preis für KI Forschung",
    "awardsHGSText": "Ich erhielt diese Auszeichnung für die Entwicklung einer KI-basierten Evolutionssimulation. Dabei entwicklen sich digitale Kreaturen, die auf neuronalen Netzen basieren und passen sich an ihre Umwelt an. Das Projekt wurde im Rahmen des Wettbewerbs Jugend Forscht entwickelt.",

    "awardsFraunhoferHeadline": "Fraunhofer Talent - Cybersecurity",
    "awardsFraunhoferText": "Als besondere Auszeichnung erhielt ich die Einladung zur Fraunhofer Cybersecurity Talent School. Das Programm ist darauf ausgelegt, Studenten im Bereich Cybersecurity auszubilden. Kernthemen sind Kryptographie, Netzwerksicherheit und Penetrationstests.",

    "awardsGFBMHeadline": "Digital Solution Award",
    "awardsGFBMText": "Ich erhielt diese Auszeichnung für die Entwicklung von Rekari. Eine Plattform für die kollaborative Datenerfassung und -analyse mithilfe von Drohnen und mobilen Sensoren. Alle relevanten Daten werden in Echtzeit mit jedem Teammitglied synchronisiert.",

    "furtherAwardsAndAchievements": "Weitere Auszeichnungen und Erfolge"


}