{
    "title": "ASC: Innovation in Communication",
    "slug": "asc",
    "title_de": "ASC: Innovation in der Kommunikation",
    "company_image": "/logos/asc.svg",
    "image": null,
    "content": [
        {
            "type": "text",
            "text": "ASC is a leading provider of innovative solutions to record, analyze, and evaluate multimedia interactions. The company's software captures, stores, and analyzes communication data, providing valuable insights for compliance, quality management, and customer service. With a strong focus on research and development, ASC is committed to delivering cutting-edge solutions for communication and collaboration.",
            "text_de": "ASC ist ein führender Anbieter innovativer Lösungen zur Aufzeichnung, Analyse und Auswertung multimedialer Interaktionen. Die Software des Unternehmens erfasst, speichert und analysiert Kommunikationsdaten und liefert wertvolle Erkenntnisse für Compliance, Qualitätsmanagement und Kundenservice. Mit einem starken Fokus auf Forschung und Entwicklung ist ASC bestrebt, modernste Lösungen für Kommunikation und Zusammenarbeit bereitzustellen."
        },
        {
            "type": "headline",
            "text": "Internship @ ASC",
            "text_de": "Praktikum bei ASC"
        },
        {
            "type": "text",
            "text": "As part of the SANTO initiative (School academy for science and technology in the upper high-school), I had the opportunity to complete an internship at ASC. The task was to design and develop a web-based application that provides a topic-divided chat system for internal communication. Additionally, our software offered the possibility to provide various apps for chat, including the option to generate context-specific answers using generative artificial intelligence.",
            "text_de": "Als Teil der SANTO-Initiative (Schülerakademie für Naturwissenschaft und Technik in der Oberstufe) hatte ich die Gelegenheit, ein Praktikum bei ASC zu absolvieren. Die Aufgabe war es, eine web-basierte Anwendung zu konzipieren und zu entwickeln, die ein themenunterteiltes Chatsystem für die interne Kommunikation bereitstellt. Zusätzlich bot unsere Software die Möglichkeit zum Chat verschiedenste Apps bereitzustellen. Darunter auch die Option, mithilfe von generativer künstlicher Intelligenz kontextspezifische Antworten zu generieren."
        },
        {
            "type": "text",
            "text_de": "Besonders spannend fand ich innerhalb des Praktikums vom inneren Aufbau der Produktivsoftware bei ASC zu erfahren. Dabei konnte ich wertvolle Einblicke in die large-scale Entwicklung von Softwarelösungen innerhalb dieser Kommunikationsbranche gewinnen. Insbesondere hat unser Praktiumsleiter einen großen Wert auf Kollaboration und Teamarbeit gelegt und viele Möglichkeiten der agilen Softwareentwicklung aufgezeigt.",
            "text": "I found it particularly exciting to learn about the internal structure of the productive software at ASC during the internship. This allowed me to gain valuable insights into the large-scale development of software solutions within this communication industry. In particular, our internship supervisor placed great value on collaboration and teamwork, and demonstrated many opportunities for agile software development."
        },
        {
            "type": "text",
            "text_de": "Erfahre mehr über die regionale SANTO-Initiative:",
            "text": "Learn more about the regional SANTO initiative:"
        },
        {
            "type": "link",
            "text": "th-ab.de/santo",
            "href": "https://www.th-ab.de/studium/vor-dem-studium/kennenlernangebote/santo/"
        }
    ]
}