{
  "title": "EKES - Evolution Simulation: A Virtual Exploration of Evolution and AI",
  "image": "/content/ekes-large.webp",
  "content": [
    {
      "type": "text",
      "text": "EKES is a computer-based simulation that models an ecosystem where virtual creatures evolve based on genetic algorithms. These creatures move, reproduce, and survive in a digital environment, with energy limitations that mimic the challenges of real-world ecosystems. As creatures evolve, their neural networks undergo mutations, improving their survival strategies and 'intelligence' over time."
    },
    {
      "type": "headline",
      "text": "How EKES Works"
    },
    {
      "type": "text",
      "text": "In EKES, each creature has a neural network that governs its actions. These networks evolve through mutations passed down to offspring, affecting their movement, energy consumption, and ability to interact with their environment. The ecosystem is designed to challenge the creatures by offering resources and obstacles, with creatures dying when their energy runs out. Those that survive reproduce, passing on their genetic information to the next generation, leading to improved behaviors over time."
    },
    {
      "type": "image",
      "src": "/content/ekes-nn.webp",
      "text": "Visualization of the neural network used in EKES"
    },
    {
      "type": "text",
      "text": "The focus of EKES is to demonstrate how small genetic changes lead to the gradual evolution of more intelligent creatures. The creatures adapt to environmental changes, such as simulated climate shifts or resource scarcity, showcasing natural selection in action."
    },
    {
      "type": "headline",
      "text": "Adapting to Environmental Changes"
    },
    {
      "type": "text",
      "text": "EKES also explores how entire ecosystems adapt to environmental changes. The simulation can introduce challenges, forcing creatures to evolve and adapt to survive. Notably, EKES was also tested with a virtual virus mimicking a pandemic, adding a layer of complexity to the ecosystem. Creatures had to adapt not only to environmental shifts but also to new threats, such as disease, which mirrors the challenges faced by living organisms in the real world. Watching how the ecosystem adjusts to these pressures provides valuable insights into the processes of natural selection and evolution."
    },
    {
      "type": "headline",
      "text": "Awards and Project Recognition"
    },
    {
      "type": "text",
      "text": "EKES has received recognition for its innovative approach of simulating AI in a educational platform. The project was presented at the 2021 Landeswettbewerb Jugend forscht and received positive feedback from the jury resulting in the special award for artificial intelligence from the Hermann Gutmann fundation. The simulation's ability to model complex interactions and evolutionary processes was commended, highlighting its potential for educational and research purposes."
    },
    {
      "type": "headline",
      "text": "Genetic Algorithms and AI Research"
    },
    {
      "type": "text",
      "text": "By utilizing genetic algorithms, EKES demonstrates how creatures can evolve without traditional training data. This approach mirrors real-world evolution, where adaptation and survival are key. The project has potential applications for AI research, helping us better understand how intelligent systems can evolve and improve autonomously."
    },
    {
      "type": "text",
      "text": "View Live Simulation here:"
    },
    {
      "type": "link",
      "text": "ekes.tim-arnold.de",
      "href": "http://ekes.tim-arnold.de"
    }
  ]
}
